#import "PaymentsDB.h"

@interface PaymentsDB()

@property (nonatomic) NSArray* payments;

@end

@implementation PaymentsDB

+(PaymentsDB*)sharedInstance {
    static dispatch_once_t runOnce;
    static id sharedObject = nil;

    dispatch_once(&runOnce, ^{
        sharedObject = [[self alloc] init];
    });

    return sharedObject;
}

-(id)init {
    self = [super init];
    if (!self) {
        return nil;
    }

    _payments = @[
                  @{
                      @"Плательщик":@{
                              @"Наименование":@"ЗАО \"Актив-софт\"",
                              @"ИНН":@"7712545785",
                              @"КПП":@"771254552",
                              @"Счет":@"40702800000012354457",
                              },
                      @"Банк плательщика":@{
                              @"Наименование":@"ОАО ВТБ",
                              @"БИК":@"044525187",
                              @"Счет":@"30101810700000000187",
                              },
                      @"Получатель":@{
                              @"Наименование":@"ОАО \"Нефтегаз\"",
                              @"ИНН":@"7707083893",
                              @"КПП":@"775003035",
                              @"Счет":@"40101810800000014958",
                              },
                      @"Банк получателя":@{
                              @"Наименование":@"ПАО Сбербанк",
                              @"БИК":@"044525225",
                              @"Счет":@"30101810400000000225",
                              },
                      @"Информация":@{
                              @"Сумма":@"7500",
                              @"Назначение":@"За телепатические услуги",
                              @"Дата":@"12 мая 2014",
                              },
                      },
                  @{
                      @"Плательщик":@{
                              @"Наименование":@"ЗАО \"Актив-софт\"",
                              @"ИНН":@"7712545785",
                              @"КПП":@"771254552",
                              @"Счет":@"40702800000012354457",
                              },
                      @"Банк плательщика":@{
                              @"Наименование":@"ОАО ВТБ",
                              @"БИК":@"044525187",
                              @"Счет":@"30101810700000000187",
                              },
                      @"Получатель":@{
                              @"Наименование":@"ЗАО \"Вавилон\"",
                              @"ИНН":@"7707083893",
                              @"КПП":@"775003035",
                              @"Счет":@"40101810800000010244",
                              },
                      @"Банк получателя":@{
                              @"Наименование":@"ПАО Сбербанк",
                              @"БИК":@"044525225",
                              @"Счет":@"30101810400000000225",
                              },
                      @"Информация":@{
                              @"Сумма":@"1500",
                              @"Назначение":@"За телепатические услуги",
                              @"Дата":@"13 мая 2014",
                              },
                      },
                  @{
                      @"Плательщик":@{
                              @"Наименование":@"ЗАО \"Актив-софт\"",
                              @"ИНН":@"7712545785",
                              @"КПП":@"771254552",
                              @"Счет":@"40702800000012354457",
                              },
                      @"Банк плательщика":@{
                              @"Наименование":@"ОАО ВТБ",
                              @"БИК":@"044525187",
                              @"Счет":@"30101810700000000187",
                              },
                      @"Получатель":@{
                              @"Наименование":@"ФГУП СервисКонтакт",
                              @"ИНН":@"7707083893",
                              @"КПП":@"775003035",
                              @"Счет":@"40101810800000010283",
                              },
                      @"Банк получателя":@{
                              @"Наименование":@"ПАО Сбербанк",
                              @"БИК":@"044525225",
                              @"Счет":@"30101810400000000225",
                              },
                      @"Информация":@{
                              @"Сумма":@"150000",
                              @"Назначение":@"За телепатические услуги",
                              @"Дата":@"17 мая 2014",
                              },
                      },
                  @{
                      @"Плательщик":@{
                              @"Наименование":@"ЗАО \"Актив-софт\"",
                              @"ИНН":@"7712545785",
                              @"КПП":@"771254552",
                              @"Счет":@"40702800000012354457",
                              },
                      @"Банк плательщика":@{
                              @"Наименование":@"ОАО ВТБ",
                              @"БИК":@"044525187",
                              @"Счет":@"30101810700000000187",
                              },
                      @"Получатель":@{
                              @"Наименование":@"ОАО \"Нефтегаз\"",
                              @"ИНН":@"7707083893",
                              @"КПП":@"775003035",
                              @"Счет":@"40101810800000014958",
                              },
                      @"Банк получателя":@{
                              @"Наименование":@"ПАО Сбербанк",
                              @"БИК":@"044525225",
                              @"Счет":@"30101810400000000225",
                              },
                      @"Информация":@{
                              @"Сумма":@"250000",
                              @"Назначение":@"За телепатические услуги",
                              @"Дата":@"21 мая 2014",
                              },
                      },
                  @{
                      @"Плательщик":@{
                              @"Наименование":@"ЗАО \"Актив-софт\"",
                              @"ИНН":@"7712545785",
                              @"КПП":@"771254552",
                              @"Счет":@"40702800000012354457",
                              },
                      @"Банк плательщика":@{
                              @"Наименование":@"ОАО ВТБ",
                              @"БИК":@"044525187",
                              @"Счет":@"30101810700000000187",
                              },
                      @"Получатель":@{
                              @"Наименование":@"ФГУП СервисКонтакт",
                              @"ИНН":@"7707083893",
                              @"КПП":@"775003035",
                              @"Счет":@"40101810800000010283",
                              },
                      @"Банк получателя":@{
                              @"Наименование":@"ПАО Сбербанк",
                              @"БИК":@"044525225",
                              @"Счет":@"30101810400000000225",
                              },
                      @"Информация":@{
                              @"Сумма":@"1500",
                              @"Назначение":@"За телепатические услуги",
                              @"Дата":@"7 июня 2014",
                              },
                      },
                  ];

    return self;
}

-(NSArray*)getPayments {
    return _payments;
}

-(NSString*)getDateByIndex:(NSUInteger)index {
    if (index >= [_payments count]) {
        return @"";
    }

    return _payments[index][@"Информация"][@"Дата"];
}

-(NSString*)getRecipientByIndex:(NSUInteger)index {
    if (index >= [_payments count]) {
        return @"";
    }

    return _payments[index][@"Получатель"][@"Наименование"];
}

-(NSString*)getSumByIndex:(NSUInteger)index {
    if (index >= [_payments count]) {
        return @"";
    }

    return _payments[index][@"Информация"][@"Сумма"];
}

@end
